[Killed] ConditionalExpression
src/common/filters/http-exception.filter.ts:17:9
     const response = ctx.getResponse<Response>();
     const request = ctx.getRequest<Request>();
 
-    if (exception instanceof HttpException) {
+    if (false) {
       const status = exception.getStatus();
       const payload = exception.getResponse() as
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithObjectPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/common/filters/http-exception.filter.ts:17:9
     const response = ctx.getResponse<Response>();
     const request = ctx.getRequest<Request>();
 
-    if (exception instanceof HttpException) {
+    if (true) {
       const status = exception.getStatus();
       const payload = exception.getResponse() as
killedBy: HttpExceptionFilter shouldSerializeUnknownExceptionAsInternalError
statusReason: TypeError: exception.getStatus is not a function

[Killed] EqualityOperator
src/common/filters/http-exception.filter.ts:22:23
       const payload = exception.getResponse() as
         | string
         | { message?: string | string[]; error?: string; details?: unknown };
-      const message = typeof payload === 'string' ? payload : payload.message;
+      const message = typeof payload !== 'string' ? payload : payload.message;
 
       response.status(status).json({
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithObjectPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": "fallo", "path": "/api/x", "timestamp": Any<String>}
Received: {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": {"details": {"field": "x"}, "message": "fallo"}, "path": "/api/x", "timestamp":

[Killed] ConditionalExpression
src/common/filters/http-exception.filter.ts:22:23
       const payload = exception.getResponse() as
         | string
         | { message?: string | string[]; error?: string; details?: unknown };
-      const message = typeof payload === 'string' ? payload : payload.message;
+      const message = true ? payload : payload.message;
 
       response.status(status).json({
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithObjectPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": "fallo", "path": "/api/x", "timestamp": Any<String>}
Received: {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": {"details": {"field": "x"}, "message": "fallo"}, "path": "/api/x", "timestamp":

[Killed] ObjectLiteral
src/common/filters/http-exception.filter.ts:24:36
         | { message?: string | string[]; error?: string; details?: unknown };
       const message = typeof payload === 'string' ? payload : payload.message;
 
-      response.status(status).json({
-        code: status,
-        message,
-        details: typeof payload === 'string' ? null : payload,
-        path: request.url,
-        timestamp: new Date().toISOString(),
-      });
+      response.status(status).json({});
       return;
     }
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithObjectPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": "fallo", "path": "/api/x", "timestamp": Any<String>}
Received: {}

Number of calls: 1

[Killed] EqualityOperator
src/common/filters/http-exception.filter.ts:27:18
       response.status(status).json({
         code: status,
         message,
-        details: typeof payload === 'string' ? null : payload,
+        details: typeof payload !== 'string' ? null : payload,
         path: request.url,
         timestamp: new Date().toISOString(),
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithObjectPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": 400, "details": {"details": {"field": "x"}, "message": "fallo"}, "message": "fallo", "path": "/api/x", "timestamp": Any<String>}
Received: {"code": 400, "details": null, "message": "fallo", "path": "/api/x", "timestamp": "2026-05-13T21:22:06.697Z"}

Number of calls: 1

[Killed] ConditionalExpression
src/common/filters/http-exception.filter.ts:27:18
       response.status(status).json({
         code: status,
         message,
-        details: typeof payload === 'string' ? null : payload,
+        details: false ? null : payload,
         path: request.url,
         timestamp: new Date().toISOString(),
killedBy: HttpExceptionFilter shouldSerializeHttpExceptionWithStringPayload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": 404, "details": null, "message": "texto-plano", "path": "/api/y", "timestamp": Any<String>}
Received: {"code": 404, "details": "texto-plano", "message": "texto-plano", "path": "/api/y", "timestamp": "2026-05-13T21:22:06.468Z"}

Number of calls: 1
