[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:38:65
     private readonly productsRepository: Repository<ProductEntity>,
   ) {}
 
-  private withMovementJoin(): SelectQueryBuilder<ProductEntity> {
-    return this.productsRepository
-      .createQueryBuilder('product')
-      .leftJoin('product.movements', 'movement');
-  }
+  private withMovementJoin(): SelectQueryBuilder<ProductEntity> {}
 
   private addStockAggregate(
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: TypeError: Cannot read properties of undefined (reading 'select')

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:41:38
   private withMovementJoin(): SelectQueryBuilder<ProductEntity> {
     return this.productsRepository
       .createQueryBuilder('product')
-      .leftJoin('product.movements', 'movement');
+      .leftJoin('product.movements', "");
   }
 
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.movements", "movement"
Received: "product.movements", ""

Number of calls: 1

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:41:17
   private withMovementJoin(): SelectQueryBuilder<ProductEntity> {
     return this.productsRepository
       .createQueryBuilder('product')
-      .leftJoin('product.movements', 'movement');
+      .leftJoin("", 'movement');
   }
 
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.movements", "movement"
Received: "", "movement"

Number of calls: 1

[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:47:40
   private addStockAggregate(
     qb: SelectQueryBuilder<ProductEntity>,
     alias: string,
-  ): SelectQueryBuilder<ProductEntity> {
-    return qb.addSelect(STOCK_SUM_SQL, alias).setParameters(STOCK_PARAMS);
-  }
+  ): SelectQueryBuilder<ProductEntity> {}
 
   async findAllProductsWithStockRaw(): Promise<ProductWithStockRawRow[]> {
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
 COALESCE(SUM(CASE WHEN movement.type = :outType THEN movement.quantity ELSE 0 END), 0)", "currentStock"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:51:74
     return qb.addSelect(STOCK_SUM_SQL, alias).setParameters(STOCK_PARAMS);
   }
 
-  async findAllProductsWithStockRaw(): Promise<ProductWithStockRawRow[]> {
-    const qb = this.withMovementJoin()
-      .select('product.id', 'id')
-      .addSelect('product.name', 'name')
-      .addSelect('product.description', 'description')
-      .addSelect('product.unitMeasure', 'unitMeasure')
-      .addSelect('product.minimumStock', 'minimumStock')
-      .addSelect('product.status', 'status')
-      .addSelect('product.createdAt', 'createdAt')
-      .addSelect('product.updatedAt', 'updatedAt');
-    this.addStockAggregate(qb, 'currentStock');
-    return qb
-      .groupBy('product.id')
-      .addGroupBy('product.name')
-      .addGroupBy('product.description')
-      .addGroupBy('product.unitMeasure')
-      .addGroupBy('product.minimumStock')
-      .addGroupBy('product.status')
-      .addGroupBy('product.createdAt')
-      .addGroupBy('product.updatedAt')
-      .orderBy('product.createdAt', 'DESC')
-      .getRawMany<ProductWithStockRawRow>();
-  }
+  async findAllProductsWithStockRaw(): Promise<ProductWithStockRawRow[]> {}
 
   async findOneProductWithStockRaw(id: string): Promise<ProductWithStockRawRow | null> {
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"createdAt": 2024-01-01T00:00:00.000Z, "currentStock": "10.50", "description": null, "id": "id-1", "minimumStock": "1.00", "name": "A", "status": "activo", "unitMeasure": "kg", "updatedAt": 2024-01-02T00:00:00.000Z}]
Received: undefined

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:53:15
 
   async findAllProductsWithStockRaw(): Promise<ProductWithStockRawRow[]> {
     const qb = this.withMovementJoin()
-      .select('product.id', 'id')
+      .select("", 'id')
       .addSelect('product.name', 'name')
       .addSelect('product.description', 'description')
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.id", "id"
Received: "", "id"

Number of calls: 1

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:54:34
   async findAllProductsWithStockRaw(): Promise<ProductWithStockRawRow[]> {
     const qb = this.withMovementJoin()
       .select('product.id', 'id')
-      .addSelect('product.name', 'name')
+      .addSelect('product.name', "")
       .addSelect('product.description', 'description')
       .addSelect('product.unitMeasure', 'unitMeasure')
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.name", "name"
Received
       1: "product.name", ""
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:55:41
     const qb = this.withMovementJoin()
       .select('product.id', 'id')
       .addSelect('product.name', 'name')
-      .addSelect('product.description', 'description')
+      .addSelect('product.description', "")
       .addSelect('product.unitMeasure', 'unitMeasure')
       .addSelect('product.minimumStock', 'minimumStock')
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.description", "description"
Received
       1: "product.name", "name"
       2: "product.description", ""
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:60:39
       .addSelect('product.minimumStock', 'minimumStock')
       .addSelect('product.status', 'status')
       .addSelect('product.createdAt', 'createdAt')
-      .addSelect('product.updatedAt', 'updatedAt');
+      .addSelect('product.updatedAt', "");
     this.addStockAggregate(qb, 'currentStock');
     return qb
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.updatedAt", "updatedAt"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:65:19
     return qb
       .groupBy('product.id')
       .addGroupBy('product.name')
-      .addGroupBy('product.description')
+      .addGroupBy("")
       .addGroupBy('product.unitMeasure')
       .addGroupBy('product.minimumStock')
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.description"
Received
       1: "product.name"
       2: ""
       3: "product.unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:66:19
       .groupBy('product.id')
       .addGroupBy('product.name')
       .addGroupBy('product.description')
-      .addGroupBy('product.unitMeasure')
+      .addGroupBy("")
       .addGroupBy('product.minimumStock')
       .addGroupBy('product.status')
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.unitMeasure"
Received
       1: "product.name"
       2: "product.description"
       3: ""

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:71:37
       .addGroupBy('product.status')
       .addGroupBy('product.createdAt')
       .addGroupBy('product.updatedAt')
-      .orderBy('product.createdAt', 'DESC')
+      .orderBy('product.createdAt', "")
       .getRawMany<ProductWithStockRawRow>();
   }
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.createdAt", "DESC"
Received: "product.createdAt", ""

Number of calls: 1

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:71:16
       .addGroupBy('product.status')
       .addGroupBy('product.createdAt')
       .addGroupBy('product.updatedAt')
-      .orderBy('product.createdAt', 'DESC')
+      .orderBy("", 'DESC')
       .getRawMany<ProductWithStockRawRow>();
   }
killedBy: ProductStockQueryService shouldReturnAllProductsWithAggregatedStock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.createdAt", "DESC"
Received: "", "DESC"

Number of calls: 1

[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:75:88
       .getRawMany<ProductWithStockRawRow>();
   }
 
-  async findOneProductWithStockRaw(id: string): Promise<ProductWithStockRawRow | null> {
-    const qb = this.withMovementJoin()
-      .select('product.id', 'id')
-      .addSelect('product.name', 'name')
-      .addSelect('product.description', 'description')
-      .addSelect('product.unitMeasure', 'unitMeasure')
-      .addSelect('product.minimumStock', 'minimumStock')
-      .addSelect('product.status', 'status')
-      .addSelect('product.createdAt', 'createdAt')
-      .addSelect('product.updatedAt', 'updatedAt');
-    this.addStockAggregate(qb, 'currentStock');
-    const row = await qb
-      .where('product.id = :id', { id })
-      .groupBy('product.id')
-      .addGroupBy('product.name')
-      .addGroupBy('product.description')
-      .addGroupBy('product.unitMeasure')
-      .addGroupBy('product.minimumStock')
-      .addGroupBy('product.status')
-      .addGroupBy('product.createdAt')
-      .addGroupBy('product.updatedAt')
-      .getRawOne<ProductWithStockRawRow>();
-    return row ?? null;
-  }
+  async findOneProductWithStockRaw(id: string): Promise<ProductWithStockRawRow | null> {}
 
   async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2026-05-13T21:22:16.922Z, "currentStock": "0.00", "description": "d", "id": "id-2", "minimumStock": "2.00", "name": "B", "status": "inactivo", "unitMeasure": "unidades", "updatedAt": 2026-05-13T21:22:16.922Z}
Received: undefined

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:79:18
     const qb = this.withMovementJoin()
       .select('product.id', 'id')
       .addSelect('product.name', 'name')
-      .addSelect('product.description', 'description')
+      .addSelect("", 'description')
       .addSelect('product.unitMeasure', 'unitMeasure')
       .addSelect('product.minimumStock', 'minimumStock')
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.description", "description"
Received
       1: "product.name", "name"
       2: "", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:80:18
       .select('product.id', 'id')
       .addSelect('product.name', 'name')
       .addSelect('product.description', 'description')
-      .addSelect('product.unitMeasure', 'unitMeasure')
+      .addSelect("", 'unitMeasure')
       .addSelect('product.minimumStock', 'minimumStock')
       .addSelect('product.status', 'status')
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.unitMeasure", "unitMeasure"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:82:18
       .addSelect('product.description', 'description')
       .addSelect('product.unitMeasure', 'unitMeasure')
       .addSelect('product.minimumStock', 'minimumStock')
-      .addSelect('product.status', 'status')
+      .addSelect("", 'status')
       .addSelect('product.createdAt', 'createdAt')
       .addSelect('product.updatedAt', 'updatedAt');
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.status", "status"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:83:39
       .addSelect('product.unitMeasure', 'unitMeasure')
       .addSelect('product.minimumStock', 'minimumStock')
       .addSelect('product.status', 'status')
-      .addSelect('product.createdAt', 'createdAt')
+      .addSelect('product.createdAt', "")
       .addSelect('product.updatedAt', 'updatedAt');
     this.addStockAggregate(qb, 'currentStock');
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.createdAt", "createdAt"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:84:18
       .addSelect('product.minimumStock', 'minimumStock')
       .addSelect('product.status', 'status')
       .addSelect('product.createdAt', 'createdAt')
-      .addSelect('product.updatedAt', 'updatedAt');
+      .addSelect("", 'updatedAt');
     this.addStockAggregate(qb, 'currentStock');
     const row = await qb
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.updatedAt", "updatedAt"
Received
       1: "product.name", "name"
       2: "product.description", "description"
       3: "product.unitMeasure", "unitMeasure"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:94:19
       .addGroupBy('product.unitMeasure')
       .addGroupBy('product.minimumStock')
       .addGroupBy('product.status')
-      .addGroupBy('product.createdAt')
+      .addGroupBy("")
       .addGroupBy('product.updatedAt')
       .getRawOne<ProductWithStockRawRow>();
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.createdAt"
Received
       1: "product.name"
       2: "product.description"
       3: "product.unitMeasure"

[Killed] LogicalOperator
src/common/services/product-stock-query.service.ts:97:12
       .addGroupBy('product.createdAt')
       .addGroupBy('product.updatedAt')
       .getRawOne<ProductWithStockRawRow>();
-    return row ?? null;
+    return row && null;
   }
 
killedBy: ProductStockQueryService shouldReturnOneProductRowOrNull
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2026-05-13T21:22:24.287Z, "currentStock": "0.00", "description": "d", "id": "id-2", "minimumStock": "2.00", "name": "B", "status": "inactivo", "unitMeasure": "unidades", "updatedAt": 2026-05-13T21:22:24.287Z}
Received: null

[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:100:69
     return row ?? null;
   }
 
-  async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {
-    const qb = this.withMovementJoin()
-      .select('product.id', 'productId')
-      .addSelect('product.name', 'name')
-      .addSelect('product.minimumStock', 'minimumStock');
-    this.addStockAggregate(qb, 'currentStock');
-    return qb
-      .groupBy('product.id')
-      .addGroupBy('product.name')
-      .addGroupBy('product.minimumStock')
-      .getRawMany<InventoryStockRawRow>();
-  }
+  async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {}
 
   async findOneInventoryStockRaw(productId: string): Promise<InventoryStockRawRow | null> {
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"currentStock": "1.00", "minimumStock": "3.00", "name": "N", "productId": "p1"}]
Received: undefined

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:102:15
 
   async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {
     const qb = this.withMovementJoin()
-      .select('product.id', 'productId')
+      .select("", 'productId')
       .addSelect('product.name', 'name')
       .addSelect('product.minimumStock', 'minimumStock');
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.id", "productId"
Received: "", "productId"

Number of calls: 1

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:102:29
 
   async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {
     const qb = this.withMovementJoin()
-      .select('product.id', 'productId')
+      .select('product.id', "")
       .addSelect('product.name', 'name')
       .addSelect('product.minimumStock', 'minimumStock');
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.id", "productId"
Received: "product.id", ""

Number of calls: 1

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:103:18
   async findAllInventoryStockRaw(): Promise<InventoryStockRawRow[]> {
     const qb = this.withMovementJoin()
       .select('product.id', 'productId')
-      .addSelect('product.name', 'name')
+      .addSelect("", 'name')
       .addSelect('product.minimumStock', 'minimumStock');
     this.addStockAggregate(qb, 'currentStock');
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.name", "name"
Received
       1: "", "name"
       2: "product.minimumStock", "minimumStock"
       3: "COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
 COALESCE(SUM(CASE WHEN movement.type = :outType THEN movement.quantity ELSE 0 END), 0)", "currentStock"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:104:18
     const qb = this.withMovementJoin()
       .select('product.id', 'productId')
       .addSelect('product.name', 'name')
-      .addSelect('product.minimumStock', 'minimumStock');
+      .addSelect("", 'minimumStock');
     this.addStockAggregate(qb, 'currentStock');
     return qb
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.minimumStock", "minimumStock"
Received
       1: "product.name", "name"
       2: "", "minimumStock"
       3: "COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
 COALESCE(SUM(CASE WHEN movement.type = :outType THEN movement.quantity ELSE 0 END), 0)", "currentStock"

[Killed] StringLiteral
src/common/services/product-stock-query.service.ts:108:19
     this.addStockAggregate(qb, 'currentStock');
     return qb
       .groupBy('product.id')
-      .addGroupBy('product.name')
+      .addGroupBy("")
       .addGroupBy('product.minimumStock')
       .getRawMany<InventoryStockRawRow>();
killedBy: ProductStockQueryService shouldReturnInventoryRowsForAllProducts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "product.name"
Received
       1: ""
       2: "product.minimumStock"

Number of calls: 2

[Killed] BlockStatement
src/common/services/product-stock-query.service.ts:113:91
       .getRawMany<InventoryStockRawRow>();
   }
 
-  async findOneInventoryStockRaw(productId: string): Promise<InventoryStockRawRow | null> {
-    const qb = this.withMovementJoin()
-      .select('product.id', 'productId')
-      .addSelect('product.name', 'name')
-      .addSelect('product.minimumStock', 'minimumStock');
-    this.addStockAggregate(qb, 'currentStock');
-    const row = await qb
-      .where('product.id = :id', { id: productId })
-      .groupBy('product.id')
-      .addGroupBy('product.name')
-      .addGroupBy('product.minimumStock')
-      .getRawOne<InventoryStockRawRow>();
-    return row ?? null;
-  }
+  async findOneInventoryStockRaw(productId: string): Promise<InventoryStockRawRow | null> {}
 }
 
killedBy: ProductStockQueryService shouldReturnInventoryRowForOneProductOrNull
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"currentStock": "5.00", "minimumStock": "1.00", "name": "One", "productId": "p9"}
Received: undefined

[Killed] LogicalOperator
src/common/services/product-stock-query.service.ts:125:12
       .addGroupBy('product.name')
       .addGroupBy('product.minimumStock')
       .getRawOne<InventoryStockRawRow>();
-    return row ?? null;
+    return row && null;
   }
 }
killedBy: ProductStockQueryService shouldReturnInventoryRowForOneProductOrNull
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"currentStock": "5.00", "minimumStock": "1.00", "name": "One", "productId": "p9"}
Received: null
