[Killed] BlockStatement
src/inventory/inventory.controller.ts:9:13
   constructor(private readonly inventoryService: InventoryService) {}
 
   @Get()
-  findAll() {
-    return this.inventoryService.findAll();
-  }
+  findAll() {}
 
   @Get('alerts/low-stock')
killedBy: InventoryController shouldDelegateFindAllToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/inventory/inventory.controller.ts:14:18
   }
 
   @Get('alerts/low-stock')
-  findLowStock() {
-    return this.inventoryService.findLowStockAlerts();
-  }
+  findLowStock() {}
 
   @Get(':productId')
killedBy: InventoryController shouldDelegateLowStockAlertsToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/inventory/inventory.controller.ts:19:65
   }
 
   @Get(':productId')
-  findOne(@Param('productId', ParseUUIDPipe) productId: string) {
-    return this.inventoryService.findOne(productId);
-  }
+  findOne(@Param('productId', ParseUUIDPipe) productId: string) {}
 }
 
killedBy: InventoryController shouldDelegateFindOneToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined
