[Killed] BlockStatement
src/inventory/inventory.service.ts:8:19
 export class InventoryService {
   constructor(private readonly productStockQuery: ProductStockQueryService) {}
 
-  async findAll() {
-    const rows = await this.productStockQuery.findAllInventoryStockRaw();
-    return rows.map((row) => ({
-      productId: row.productId,
-      name: row.name,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    }));
-  }
+  async findAll() {}
 
   async findOne(productId: string) {
killedBy: InventoryService shouldIncludeProductInLowStockAlertsWhenCurrentIsBelowMinimum
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ArrowFunction
src/inventory/inventory.service.ts:10:21
 
   async findAll() {
     const rows = await this.productStockQuery.findAllInventoryStockRaw();
-    return rows.map((row) => ({
-      productId: row.productId,
-      name: row.name,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    }));
+    return rows.map(() => undefined);
   }
 
killedBy: InventoryService shouldIncludeProductInLowStockAlertsWhenCurrentIsBelowMinimum
statusReason: TypeError: Cannot read properties of undefined (reading 'currentStock')

[Killed] BlockStatement
src/inventory/inventory.service.ts:18:36
     }));
   }
 
-  async findOne(productId: string) {
-    const row = await this.productStockQuery.findOneInventoryStockRaw(productId);
-    if (!row) {
-      throw new NotFoundException('Producto no encontrado');
-    }
-    return {
-      productId: row.productId,
-      name: row.name,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    };
-  }
+  async findOne(productId: string) {}
 
   async findLowStockAlerts() {
killedBy: InventoryService shouldThrowNotFoundWhenInventoryProductMissing
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/inventory/inventory.service.ts:20:9
 
   async findOne(productId: string) {
     const row = await this.productStockQuery.findOneInventoryStockRaw(productId);
-    if (!row) {
+    if (row) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: InventoryService shouldThrowNotFoundWhenInventoryProductMissing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] ConditionalExpression
src/inventory/inventory.service.ts:20:9
 
   async findOne(productId: string) {
     const row = await this.productStockQuery.findOneInventoryStockRaw(productId);
-    if (!row) {
+    if (true) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: InventoryService shouldMapFindOneInventoryRowToNumbers
statusReason: Error: expect(received).resolves.toEqual()

Received promise rejected instead of resolved
Rejected to value: [NotFoundException: Producto no encontrado]

[Killed] BlockStatement
src/inventory/inventory.service.ts:31:30
     };
   }
 
-  async findLowStockAlerts() {
-    const all = await this.findAll();
-    return all.filter((item) => item.currentStock <= item.minimumStock);
-  }
+  async findLowStockAlerts() {}
 }
 
killedBy: InventoryService shouldIncludeProductInLowStockAlertsWhenCurrentIsBelowMinimum
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/inventory/inventory.service.ts:33:33
 
   async findLowStockAlerts() {
     const all = await this.findAll();
-    return all.filter((item) => item.currentStock <= item.minimumStock);
+    return all.filter((item) => true);
   }
 }
killedBy: InventoryService shouldReturnEmptyAlertsWhenAllProductsAboveMinimum
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"currentStock": 10, "minimumStock": 3, "name": "Ok", "productId": "d"}]

[Killed] EqualityOperator
src/inventory/inventory.service.ts:33:33
 
   async findLowStockAlerts() {
     const all = await this.findAll();
-    return all.filter((item) => item.currentStock <= item.minimumStock);
+    return all.filter((item) => item.currentStock < item.minimumStock);
   }
 }
killedBy: InventoryService shouldIncludeProductWhenCurrentStockEqualsMinimum
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
