[Killed] BlockStatement
src/movements/movements.controller.ts:19:42
   constructor(private readonly movementsService: MovementsService) {}
 
   @Post()
-  create(@Body() dto: CreateMovementDto) {
-    return this.movementsService.create(dto);
-  }
+  create(@Body() dto: CreateMovementDto) {}
 
   @Get()
killedBy: MovementsController shouldDelegateCreateToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/movements/movements.controller.ts:24:49
   }
 
   @Get()
-  findAll(@Query() query: GetMovementsQueryDto) {
-    return this.movementsService.findAll(query);
-  }
+  findAll(@Query() query: GetMovementsQueryDto) {}
 
   @Get(':id')
killedBy: MovementsController shouldDelegateFindAllToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/movements/movements.controller.ts:29:51
   }
 
   @Get(':id')
-  findOne(@Param('id', ParseUUIDPipe) id: string) {
-    return this.movementsService.findOne(id);
-  }
+  findOne(@Param('id', ParseUUIDPipe) id: string) {}
 }
 
killedBy: MovementsController shouldDelegateFindOneToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined
