[Killed] ObjectLiteral
src/movements/movements.service.ts:20:30
 const STOCK_BALANCE_SELECT = `COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
  COALESCE(SUM(CASE WHEN movement.type = :outType THEN movement.quantity ELSE 0 END), 0)`;
 
-const STOCK_BALANCE_PARAMS = {
-  inType: MovementType.IN,
-  outType: MovementType.OUT,
-};
+const STOCK_BALANCE_PARAMS = {};
 
 @Injectable()
killedBy: MovementsService shouldReturnCalculatedStockForProduct
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "inType": "entrada",
-   "outType": "salida",

[Killed] StringLiteral
src/movements/movements.service.ts:44:18
     try {
       const product = await runner.manager
         .createQueryBuilder(ProductEntity, 'product')
-        .setLock('pessimistic_write')
+        .setLock("")
         .where('product.id = :id', { id: dto.productId })
         .getOne();
killedBy: MovementsService shouldPersistOutboundMovementWhenStockIsSufficient
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "pessimistic_write"
Received: ""

Number of calls: 1

[Killed] EqualityOperator
src/movements/movements.service.ts:51:11
       if (!product) {
         throw new NotFoundException('Producto no encontrado');
       }
-      if (product.status !== ProductStatus.ACTIVE) {
+      if (product.status === ProductStatus.ACTIVE) {
         throw new BadRequestException(
           'No se permiten movimientos sobre productos inactivos',
killedBy: MovementsService shouldThrowBadRequestWhenCreateAndProductIsInactive
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 4

  Object {
-   "response": ObjectContaining {
-     "message": "No se permiten movimientos sobre productos inactivos",

[Killed] ConditionalExpression
src/movements/movements.service.ts:51:11
       if (!product) {
         throw new NotFoundException('Producto no encontrado');
       }
-      if (product.status !== ProductStatus.ACTIVE) {
+      if (true) {
         throw new BadRequestException(
           'No se permiten movimientos sobre productos inactivos',
killedBy: MovementsService shouldRejectOutputMovementWhenStockIsInsufficient
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 4

  Object {
-   "response": ObjectContaining {
-     "message": "Stock insuficiente para registrar la salida",

[Killed] StringLiteral
src/movements/movements.service.ts:53:11
       }
       if (product.status !== ProductStatus.ACTIVE) {
         throw new BadRequestException(
-          'No se permiten movimientos sobre productos inactivos',
+          "",
         );
       }
killedBy: MovementsService shouldThrowBadRequestWhenCreateAndProductIsInactive
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 3

  Object {
-   "response": ObjectContaining {
-     "message": "No se permiten movimientos sobre productos inactivos",

[Killed] BlockStatement
src/movements/movements.service.ts:58:61
       }
 
       const stock = await this.getStockBalance(dto.productId, runner);
-      if (!canApplyMovement(stock, dto.type, dto.quantity)) {
-        throw new BadRequestException(
-          'Stock insuficiente para registrar la salida',
-        );
-      }
+      if (!canApplyMovement(stock, dto.type, dto.quantity)) {}
 
       const movement = runner.manager.create(MovementEntity, {
killedBy: MovementsService shouldRejectOutputMovementWhenStockIsInsufficient
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 1970-01-01T00:00:00.000Z, "date": 2026-05-13T21:22:37.678Z, "id": "saved-movement-1", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1", "quantity": "5.00", "reason": "venta", "type": "salida"}

[Killed] BooleanLiteral
src/movements/movements.service.ts:58:11
       }
 
       const stock = await this.getStockBalance(dto.productId, runner);
-      if (!canApplyMovement(stock, dto.type, dto.quantity)) {
+      if (canApplyMovement(stock, dto.type, dto.quantity)) {
         throw new BadRequestException(
           'Stock insuficiente para registrar la salida',
killedBy: MovementsService shouldRejectOutputMovementWhenStockIsInsufficient
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 1970-01-01T00:00:00.000Z, "date": 2026-05-13T21:22:37.619Z, "id": "saved-movement-1", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1", "quantity": "5.00", "reason": "venta", "type": "salida"}

[Killed] ObjectLiteral
src/movements/movements.service.ts:64:62
         );
       }
 
-      const movement = runner.manager.create(MovementEntity, {
-        ...dto,
-        quantity: dto.quantity.toFixed(2),
-        date: new Date(dto.date),
-      });
+      const movement = runner.manager.create(MovementEntity, {});
 
       const saved = await runner.manager.save(MovementEntity, movement);
killedBy: MovementsService shouldRegisterInboundMovement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "entrada"
Received: undefined

[Killed] BlockStatement
src/movements/movements.service.ts:73:21
       const saved = await runner.manager.save(MovementEntity, movement);
       await runner.commitTransaction();
       return saved;
-    } catch (error) {
-      await runner.rollbackTransaction();
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       await runner.release();
     }
killedBy: MovementsService shouldThrowNotFoundWhenCreateAndProductDoesNotExist
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/movements/movements.service.ts:76:15
     } catch (error) {
       await runner.rollbackTransaction();
       throw error;
-    } finally {
-      await runner.release();
-    }
+    } finally {}
   }
 
killedBy: MovementsService shouldPersistOutboundMovementWhenStockIsSufficient
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/movements/movements.service.ts:82:37
   }
 
   async findAll(query: GetMovementsQueryDto): Promise<MovementEntity[]> {
-    if (query.from !== undefined && query.to !== undefined) {
+    if (query.from !== undefined && query.to === undefined) {
       if (new Date(query.from) > new Date(query.to)) {
         throw new BadRequestException(
killedBy: MovementsService shouldThrowBadRequestWhenFindAllDateRangeIsInverted
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "El rango de fechas es invalido: from no puede ser mayor que to",

[Killed] BlockStatement
src/movements/movements.service.ts:82:61
   }
 
   async findAll(query: GetMovementsQueryDto): Promise<MovementEntity[]> {
-    if (query.from !== undefined && query.to !== undefined) {
-      if (new Date(query.from) > new Date(query.to)) {
-        throw new BadRequestException(
-          'El rango de fechas es invalido: from no puede ser mayor que to',
-        );
-      }
-    }
+    if (query.from !== undefined && query.to !== undefined) {}
 
     const qb = this.movementsRepository.createQueryBuilder('movement');
killedBy: MovementsService shouldThrowBadRequestWhenFindAllDateRangeIsInverted
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "El rango de fechas es invalido: from no puede ser mayor que to",

[Killed] BlockStatement
src/movements/movements.service.ts:83:54
 
   async findAll(query: GetMovementsQueryDto): Promise<MovementEntity[]> {
     if (query.from !== undefined && query.to !== undefined) {
-      if (new Date(query.from) > new Date(query.to)) {
-        throw new BadRequestException(
-          'El rango de fechas es invalido: from no puede ser mayor que to',
-        );
-      }
+      if (new Date(query.from) > new Date(query.to)) {}
     }
 
killedBy: MovementsService shouldThrowBadRequestWhenFindAllDateRangeIsInverted
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "El rango de fechas es invalido: from no puede ser mayor que to",

[Killed] EqualityOperator
src/movements/movements.service.ts:83:11
 
   async findAll(query: GetMovementsQueryDto): Promise<MovementEntity[]> {
     if (query.from !== undefined && query.to !== undefined) {
-      if (new Date(query.from) > new Date(query.to)) {
+      if (new Date(query.from) <= new Date(query.to)) {
         throw new BadRequestException(
           'El rango de fechas es invalido: from no puede ser mayor que to',
killedBy: MovementsService shouldThrowBadRequestWhenFindAllDateRangeIsInverted
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "El rango de fechas es invalido: from no puede ser mayor que to",

[Killed] ConditionalExpression
src/movements/movements.service.ts:92:9
 
     const qb = this.movementsRepository.createQueryBuilder('movement');
 
-    if (query.productId) {
+    if (false) {
       qb.andWhere('movement.productId = :productId', {
         productId: query.productId,
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] BlockStatement
src/movements/movements.service.ts:92:26
 
     const qb = this.movementsRepository.createQueryBuilder('movement');
 
-    if (query.productId) {
-      qb.andWhere('movement.productId = :productId', {
-        productId: query.productId,
-      });
-    }
+    if (query.productId) {}
     if (query.type) {
       qb.andWhere('movement.type = :type', { type: query.type });
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ConditionalExpression
src/movements/movements.service.ts:97:9
         productId: query.productId,
       });
     }
-    if (query.type) {
+    if (true) {
       qb.andWhere('movement.type = :type', { type: query.type });
     }
killedBy: MovementsService shouldNotApplyOptionalFiltersWhenFindAllQueryEmpty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "movement.type = :type", {"type": undefined}

[Killed] ConditionalExpression
src/movements/movements.service.ts:97:9
         productId: query.productId,
       });
     }
-    if (query.type) {
+    if (false) {
       qb.andWhere('movement.type = :type', { type: query.type });
     }
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] BlockStatement
src/movements/movements.service.ts:100:21
     if (query.type) {
       qb.andWhere('movement.type = :type', { type: query.type });
     }
-    if (query.from) {
-      qb.andWhere('movement.date >= :from', { from: query.from });
-    }
+    if (query.from) {}
     if (query.to) {
       qb.andWhere('movement.date <= :to', { to: query.to });
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ConditionalExpression
src/movements/movements.service.ts:100:9
     if (query.type) {
       qb.andWhere('movement.type = :type', { type: query.type });
     }
-    if (query.from) {
+    if (true) {
       qb.andWhere('movement.date >= :from', { from: query.from });
     }
killedBy: MovementsService shouldNotApplyOptionalFiltersWhenFindAllQueryEmpty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "movement.date >= :from", {"from": undefined}

[Killed] StringLiteral
src/movements/movements.service.ts:101:19
       qb.andWhere('movement.type = :type', { type: query.type });
     }
     if (query.from) {
-      qb.andWhere('movement.date >= :from', { from: query.from });
+      qb.andWhere("", { from: query.from });
     }
     if (query.to) {
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date >= :from", {"from": "2024-01-01T00:00:00.000Z"}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "from": "2024-01-01T00:00:00.000Z",

[Killed] BlockStatement
src/movements/movements.service.ts:103:19
     if (query.from) {
       qb.andWhere('movement.date >= :from', { from: query.from });
     }
-    if (query.to) {
-      qb.andWhere('movement.date <= :to', { to: query.to });
-    }
+    if (query.to) {}
 
     return qb.orderBy('movement.date', 'DESC').getMany();
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ConditionalExpression
src/movements/movements.service.ts:103:9
     if (query.from) {
       qb.andWhere('movement.date >= :from', { from: query.from });
     }
-    if (query.to) {
+    if (false) {
       qb.andWhere('movement.date <= :to', { to: query.to });
     }
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ObjectLiteral
src/movements/movements.service.ts:104:43
       qb.andWhere('movement.date >= :from', { from: query.from });
     }
     if (query.to) {
-      qb.andWhere('movement.date <= :to', { to: query.to });
+      qb.andWhere('movement.date <= :to', {});
     }
 
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date <= :to", {"to": "2024-12-31T23:59:59.999Z"}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "to": "2024-12-31T23:59:59.999Z",

[Killed] StringLiteral
src/movements/movements.service.ts:107:23
       qb.andWhere('movement.date <= :to', { to: query.to });
     }
 
-    return qb.orderBy('movement.date', 'DESC').getMany();
+    return qb.orderBy("", 'DESC').getMany();
   }
 
killedBy: MovementsService shouldApplyFiltersAndOrderWhenFindAll
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date", "DESC"
Received: "", "DESC"

Number of calls: 1

[Killed] BlockStatement
src/movements/movements.service.ts:110:54
     return qb.orderBy('movement.date', 'DESC').getMany();
   }
 
-  async findOne(id: string): Promise<MovementEntity> {
-    const movement = await this.movementsRepository.findOne({ where: { id } });
-    if (!movement) {
-      throw new NotFoundException('Movimiento no encontrado');
-    }
-    return movement;
-  }
+  async findOne(id: string): Promise<MovementEntity> {}
 
   async calculateStockByProduct(productId: string): Promise<number> {
killedBy: MovementsService shouldReturnMovementWhenFindOneExists
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: {"id": "mid", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1"}
Received: undefined

[Killed] ConditionalExpression
src/movements/movements.service.ts:112:9
 
   async findOne(id: string): Promise<MovementEntity> {
     const movement = await this.movementsRepository.findOne({ where: { id } });
-    if (!movement) {
+    if (true) {
       throw new NotFoundException('Movimiento no encontrado');
     }
killedBy: MovementsService shouldReturnMovementWhenFindOneExists
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [NotFoundException: Movimiento no encontrado]

[Killed] BlockStatement
src/movements/movements.service.ts:112:20
 
   async findOne(id: string): Promise<MovementEntity> {
     const movement = await this.movementsRepository.findOne({ where: { id } });
-    if (!movement) {
-      throw new NotFoundException('Movimiento no encontrado');
-    }
+    if (!movement) {}
     return movement;
   }
killedBy: MovementsService shouldThrowNotFoundWhenFindOneMissing
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] StringLiteral
src/movements/movements.service.ts:113:35
   async findOne(id: string): Promise<MovementEntity> {
     const movement = await this.movementsRepository.findOne({ where: { id } });
     if (!movement) {
-      throw new NotFoundException('Movimiento no encontrado');
+      throw new NotFoundException("");
     }
     return movement;
killedBy: MovementsService shouldThrowNotFoundWhenFindOneMissing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 3

  Object {
-   "response": ObjectContaining {
-     "message": "Movimiento no encontrado",

[Killed] BlockStatement
src/movements/movements.service.ts:118:69
     return movement;
   }
 
-  async calculateStockByProduct(productId: string): Promise<number> {
-    const product = await this.productsRepository.findOne({
-      where: { id: productId },
-    });
-    if (!product) {
-      throw new NotFoundException('Producto no encontrado');
-    }
-    return this.getStockBalance(productId);
-  }
+  async calculateStockByProduct(productId: string): Promise<number> {}
 
   private async getStockBalance(
killedBy: MovementsService shouldReturnCalculatedStockForProduct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42.5
Received: undefined

[Killed] ConditionalExpression
src/movements/movements.service.ts:122:9
     const product = await this.productsRepository.findOne({
       where: { id: productId },
     });
-    if (!product) {
+    if (true) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: MovementsService shouldReturnCalculatedStockForProduct
statusReason: NotFoundException: Producto no encontrado

[Killed] BooleanLiteral
src/movements/movements.service.ts:122:9
     const product = await this.productsRepository.findOne({
       where: { id: productId },
     });
-    if (!product) {
+    if (product) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: MovementsService shouldReturnCalculatedStockForProduct
statusReason: NotFoundException: Producto no encontrado

[Killed] StringLiteral
src/movements/movements.service.ts:123:35
       where: { id: productId },
     });
     if (!product) {
-      throw new NotFoundException('Producto no encontrado');
+      throw new NotFoundException("");
     }
     return this.getStockBalance(productId);
killedBy: MovementsService shouldThrowNotFoundWhenCalculatingStockForMissingProduct
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 3

  Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] BlockStatement
src/movements/movements.service.ts:131:22
   private async getStockBalance(
     productId: string,
     runner?: QueryRunner,
-  ): Promise<number> {
-    const qb = runner
-      ? runner.manager.createQueryBuilder(MovementEntity, 'movement')
-      : this.movementsRepository.createQueryBuilder('movement');
-
-    const row = await qb
-      .select(STOCK_BALANCE_SELECT, 'balance')
-      .setParameters(STOCK_BALANCE_PARAMS)
-      .where('movement.productId = :productId', { productId })
-      .getRawOne<{ balance: string }>();
-
-    return Number(row?.balance ?? 0);
-  }
+  ): Promise<number> {}
 }
 
killedBy: MovementsService shouldPersistOutboundMovementWhenStockIsSufficient
statusReason: BadRequestException: Stock insuficiente para registrar la salida

[Killed] StringLiteral
src/movements/movements.service.ts:137:37
       : this.movementsRepository.createQueryBuilder('movement');
 
     const row = await qb
-      .select(STOCK_BALANCE_SELECT, 'balance')
+      .select(STOCK_BALANCE_SELECT, "")
       .setParameters(STOCK_BALANCE_PARAMS)
       .where('movement.productId = :productId', { productId })
killedBy: MovementsService shouldReturnCalculatedStockForProduct
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
 COALESCE(SUM(CASE WHEN movement.type = :outType THEN movement.quantity ELSE 0 END), 0)", "balance"
Received: "COALESCE(SUM(CASE WHEN movement.type = :inType THEN movement.quantity ELSE 0 END), 0) -
 COALESCE(SUM(CASE WHEN movement.type = :o

[Killed] OptionalChaining
src/movements/movements.service.ts:142:19
       .where('movement.productId = :productId', { productId })
       .getRawOne<{ balance: string }>();
 
-    return Number(row?.balance ?? 0);
+    return Number(row.balance ?? 0);
   }
 }
killedBy: MovementsService shouldTreatMissingBalanceRowAsZeroStock
statusReason: TypeError: Cannot read properties of undefined (reading 'balance')

[Killed] LogicalOperator
src/movements/movements.service.ts:142:19
       .where('movement.productId = :productId', { productId })
       .getRawOne<{ balance: string }>();
 
-    return Number(row?.balance ?? 0);
+    return Number(row?.balance && 0);
   }
 }
killedBy: MovementsService shouldPersistOutboundMovementWhenStockIsSufficient
statusReason: BadRequestException: Stock insuficiente para registrar la salida
