[Killed] BlockStatement
src/movements/stock.utils.ts:7:11
   currentStock: number,
   type: MovementType,
   quantity: number,
-): number {
-  return type === MovementType.IN
-    ? currentStock + quantity
-    : currentStock - quantity;
-}
+): number {}
 
 export function canApplyMovement(
killedBy: inventory stock property-based tests shouldKeepStockNonNegativeAfterEachAppliedStep
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:1:0:1:1:1", endOnFailure: true }
Counterexample: [0,[{"kind":"IN","qty":1}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/movements/stock.utils.ts:8:10
   type: MovementType,
   quantity: number,
 ): number {
-  return type === MovementType.IN
+  return true
     ? currentStock + quantity
     : currentStock - quantity;
killedBy: inventory stock property-based tests shouldMatchFinalStockWithSumOfInsMinusSumOfAppliedOuts
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:2:2:2:2:8:17:19:0:1", endOnFailure: true }
Counterexample: [0,[{"kind":"IN","qty":1},{"kind":"OUT","qty":1}]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/movements/stock.utils.ts:8:10
   type: MovementType,
   quantity: number,
 ): number {
-  return type === MovementType.IN
+  return false
     ? currentStock + quantity
     : currentStock - quantity;
killedBy: inventory stock property-based tests shouldKeepStockNonNegativeAfterEachAppliedStep
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:1:0:1:1:1", endOnFailure: true }
Counterexample: [0,[{"kind":"IN","qty":1}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/movements/stock.utils.ts:9:7
   quantity: number,
 ): number {
   return type === MovementType.IN
-    ? currentStock + quantity
+    ? currentStock - quantity
     : currentStock - quantity;
 }
killedBy: inventory stock property-based tests shouldKeepStockNonNegativeAfterEachAppliedStep
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:1:0:1:1:1", endOnFailure: true }
Counterexample: [0,[{"kind":"IN","qty":1}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/movements/stock.utils.ts:10:7
 ): number {
   return type === MovementType.IN
     ? currentStock + quantity
-    : currentStock - quantity;
+    : currentStock + quantity;
 }
 
killedBy: inventory stock property-based tests shouldMatchFinalStockWithSumOfInsMinusSumOfAppliedOuts
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:2:2:2:2:8:17:19:0:1", endOnFailure: true }
Counterexample: [0,[{"kind":"IN","qty":1},{"kind":"OUT","qty":1}]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/movements/stock.utils.ts:17:12
   currentStock: number,
   type: MovementType,
   quantity: number,
-): boolean {
-  if (quantity <= 0) {
-    return false;
-  }
-
-  if (type === MovementType.OUT) {
-    return quantity <= currentStock;
-  }
-
-  return true;
-}
+): boolean {}
 
killedBy: MovementsService shouldPersistOutboundMovementWhenStockIsSufficient
statusReason: BadRequestException: Stock insuficiente para registrar la salida

[Killed] EqualityOperator
src/movements/stock.utils.ts:18:7
   type: MovementType,
   quantity: number,
 ): boolean {
-  if (quantity <= 0) {
+  if (quantity < 0) {
     return false;
   }
killedBy: MovementsService shouldRejectMovementWhenQuantityIsNotPositive
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 1970-01-01T00:00:00.000Z, "date": 2026-05-13T21:22:49.386Z, "id": "saved-movement-1", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1", "quantity": "0.00", "reason": "venta", "type": "salida"}

[Killed] ConditionalExpression
src/movements/stock.utils.ts:18:7
   type: MovementType,
   quantity: number,
 ): boolean {
-  if (quantity <= 0) {
+  if (false) {
     return false;
   }
killedBy: MovementsService shouldRejectMovementWhenQuantityIsNotPositive
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 1970-01-01T00:00:00.000Z, "date": 2026-05-13T21:22:49.412Z, "id": "saved-movement-1", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1", "quantity": "0.00", "reason": "venta", "type": "salida"}

[Killed] ConditionalExpression
src/movements/stock.utils.ts:22:7
     return false;
   }
 
-  if (type === MovementType.OUT) {
+  if (false) {
     return quantity <= currentStock;
   }
killedBy: MovementsService shouldRejectOutputMovementWhenStockIsInsufficient
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 1970-01-01T00:00:00.000Z, "date": 2026-05-13T21:22:50.655Z, "id": "saved-movement-1", "productId": "34f5ad27-b6a8-4538-9f67-92c2344be2d1", "quantity": "5.00", "reason": "venta", "type": "salida"}

[Killed] EqualityOperator
src/movements/stock.utils.ts:22:7
     return false;
   }
 
-  if (type === MovementType.OUT) {
+  if (type !== MovementType.OUT) {
     return quantity <= currentStock;
   }
killedBy: inventory stock property-based tests shouldKeepStockNonNegativeAfterEachAppliedStep
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:1:0:0:2", endOnFailure: true }
Counterexample: [0,[{"kind":"OUT","qty":1}]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/movements/stock.utils.ts:23:12
   }
 
   if (type === MovementType.OUT) {
-    return quantity <= currentStock;
+    return false;
   }
 
killedBy: stock.utils canApplyMovement shouldAllowOutboundMovementWhenQuantityIsLessThanOrEqualToStock
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/movements/stock.utils.ts:23:12
   }
 
   if (type === MovementType.OUT) {
-    return quantity <= currentStock;
+    return true;
   }
 
killedBy: inventory stock property-based tests shouldKeepStockNonNegativeAfterEachAppliedStep
statusReason: Error: Property failed after 1 tests
{ seed: 42, path: "0:0:1:0:0:2", endOnFailure: true }
Counterexample: [0,[{"kind":"OUT","qty":1}]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
