[Killed] BlockStatement
src/products/products.controller.ts:21:65
   constructor(private readonly productsService: ProductsService) {}
 
   @Post()
-  create(@Body() dto: CreateProductDto): Promise<ProductEntity> {
-    return this.productsService.create(dto);
-  }
+  create(@Body() dto: CreateProductDto): Promise<ProductEntity> {}
 
   @Get()
killedBy: ProductsController shouldDelegateCreateToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/products/products.controller.ts:26:42
   }
 
   @Get()
-  findAll(): Promise<ProductWithStock[]> {
-    return this.productsService.findAll();
-  }
+  findAll(): Promise<ProductWithStock[]> {}
 
   @Get(':id')
killedBy: ProductsController shouldDelegateFindAllToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/products/products.controller.ts:31:78
   }
 
   @Get(':id')
-  findOne(@Param('id', ParseUUIDPipe) id: string): Promise<ProductWithStock> {
-    return this.productsService.findOne(id);
-  }
+  findOne(@Param('id', ParseUUIDPipe) id: string): Promise<ProductWithStock> {}
 
   @Patch(':id')
killedBy: ProductsController shouldDelegateFindOneToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/products/products.controller.ts:39:29
   update(
     @Param('id', ParseUUIDPipe) id: string,
     @Body() dto: UpdateProductDto,
-  ): Promise<ProductEntity> {
-    return this.productsService.update(id, dto);
-  }
+  ): Promise<ProductEntity> {}
 
   @Delete(':id')
killedBy: ProductsController shouldDelegateUpdateToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
src/products/products.controller.ts:44:78
   }
 
   @Delete(':id')
-  deactivate(@Param('id', ParseUUIDPipe) id: string): Promise<ProductEntity> {
-    return this.productsService.deactivate(id);
-  }
+  deactivate(@Param('id', ParseUUIDPipe) id: string): Promise<ProductEntity> {}
 }
 
killedBy: ProductsController shouldDelegateDeactivateToService
statusReason: Error: expect(received).resolves.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined
