[Killed] BlockStatement
src/products/products.service.ts:33:63
     private readonly productStockQuery: ProductStockQueryService,
   ) {}
 
-  async create(dto: CreateProductDto): Promise<ProductEntity> {
-    const existing = await this.productsRepository.findOne({
-      where: { name: dto.name },
-    });
-    if (existing) {
-      throw new ConflictException('El producto ya existe');
-    }
-
-    const created = this.productsRepository.create({
-      ...dto,
-      minimumStock: dto.minimumStock.toFixed(2),
-    });
-    return this.productsRepository.save(created);
-  }
+  async create(dto: CreateProductDto): Promise<ProductEntity> {}
 
   async findAll(): Promise<ProductWithStock[]> {
killedBy: ProductsService shouldThrowConflictWhenCreateFindsDuplicateName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/products/products.service.ts:37:19
     const existing = await this.productsRepository.findOne({
       where: { name: dto.name },
     });
-    if (existing) {
-      throw new ConflictException('El producto ya existe');
-    }
+    if (existing) {}
 
     const created = this.productsRepository.create({
killedBy: ProductsService shouldThrowConflictWhenCreateFindsDuplicateName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:37:9
     const existing = await this.productsRepository.findOne({
       where: { name: dto.name },
     });
-    if (existing) {
+    if (false) {
       throw new ConflictException('El producto ya existe');
     }
killedBy: ProductsService shouldThrowConflictWhenCreateFindsDuplicateName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
src/products/products.service.ts:41:52
       throw new ConflictException('El producto ya existe');
     }
 
-    const created = this.productsRepository.create({
-      ...dto,
-      minimumStock: dto.minimumStock.toFixed(2),
-    });
+    const created = this.productsRepository.create({});
     return this.productsRepository.save(created);
   }
killedBy: ProductsService shouldCreateProductWhenDataIsValid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"minimumStock": "5.00", "name": "Nuevo", "unitMeasure": "litros"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
src/products/products.service.ts:48:48
     return this.productsRepository.save(created);
   }
 
-  async findAll(): Promise<ProductWithStock[]> {
-    const rows = await this.productStockQuery.findAllProductsWithStockRaw();
-    return rows.map((row) => ({
-      ...row,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    }));
-  }
+  async findAll(): Promise<ProductWithStock[]> {}
 
   async findOne(id: string): Promise<ProductWithStock> {
killedBy: ProductsService shouldMapNumericFieldsWhenFindAllReturnsRawRows
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [ObjectContaining {"currentStock": 3.5, "id": "a", "minimumStock": 10, "name": "P1"}]
Received: undefined

[Killed] ArrowFunction
src/products/products.service.ts:50:21
 
   async findAll(): Promise<ProductWithStock[]> {
     const rows = await this.productStockQuery.findAllProductsWithStockRaw();
-    return rows.map((row) => ({
-      ...row,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    }));
+    return rows.map(() => undefined);
   }
 
killedBy: ProductsService shouldMapNumericFieldsWhenFindAllReturnsRawRows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   ObjectContaining {
-     "currentStock": 3.5,

[Killed] ObjectLiteral
src/products/products.service.ts:50:31
 
   async findAll(): Promise<ProductWithStock[]> {
     const rows = await this.productStockQuery.findAllProductsWithStockRaw();
-    return rows.map((row) => ({
-      ...row,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    }));
+    return rows.map((row) => ({}));
   }
 
killedBy: ProductsService shouldMapNumericFieldsWhenFindAllReturnsRawRows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   ObjectContaining {
-     "currentStock": 3.5,

[Killed] BlockStatement
src/products/products.service.ts:57:56
     }));
   }
 
-  async findOne(id: string): Promise<ProductWithStock> {
-    const row = await this.productStockQuery.findOneProductWithStockRaw(id);
-    if (!row) {
-      throw new NotFoundException('Producto no encontrado');
-    }
-    return {
-      ...row,
-      minimumStock: Number(row.minimumStock),
-      currentStock: Number(row.currentStock),
-    };
-  }
+  async findOne(id: string): Promise<ProductWithStock> {}
 
   private async getEntityById(id: string): Promise<ProductEntity> {
killedBy: ProductsService shouldThrowNotFoundWhenFindOneHasNoRow
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:59:9
 
   async findOne(id: string): Promise<ProductWithStock> {
     const row = await this.productStockQuery.findOneProductWithStockRaw(id);
-    if (!row) {
+    if (false) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: ProductsService shouldThrowNotFoundWhenFindOneHasNoRow
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] BlockStatement
src/products/products.service.ts:59:15
 
   async findOne(id: string): Promise<ProductWithStock> {
     const row = await this.productStockQuery.findOneProductWithStockRaw(id);
-    if (!row) {
-      throw new NotFoundException('Producto no encontrado');
-    }
+    if (!row) {}
     return {
       ...row,
killedBy: ProductsService shouldThrowNotFoundWhenFindOneHasNoRow
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] BlockStatement
src/products/products.service.ts:69:67
     };
   }
 
-  private async getEntityById(id: string): Promise<ProductEntity> {
-    const product = await this.productsRepository.findOne({ where: { id } });
-    if (!product) {
-      throw new NotFoundException('Producto no encontrado');
-    }
-    return product;
-  }
+  private async getEntityById(id: string): Promise<ProductEntity> {}
 
   async update(id: string, dto: UpdateProductDto): Promise<ProductEntity> {
killedBy: ProductsService shouldDeactivateProductWhenNoMovements
statusReason: TypeError: Cannot set properties of undefined (setting 'status')

[Killed] ConditionalExpression
src/products/products.service.ts:71:9
 
   private async getEntityById(id: string): Promise<ProductEntity> {
     const product = await this.productsRepository.findOne({ where: { id } });
-    if (!product) {
+    if (false) {
       throw new NotFoundException('Producto no encontrado');
     }
killedBy: ProductsService shouldThrowNotFoundWhenUpdateTargetsMissingProduct
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] BlockStatement
src/products/products.service.ts:71:19
 
   private async getEntityById(id: string): Promise<ProductEntity> {
     const product = await this.productsRepository.findOne({ where: { id } });
-    if (!product) {
-      throw new NotFoundException('Producto no encontrado');
-    }
+    if (!product) {}
     return product;
   }
killedBy: ProductsService shouldThrowNotFoundWhenUpdateTargetsMissingProduct
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "response": ObjectContaining {
-     "message": "Producto no encontrado",

[Killed] LogicalOperator
src/products/products.service.ts:80:9
   async update(id: string, dto: UpdateProductDto): Promise<ProductEntity> {
     const product = await this.getEntityById(id);
 
-    if (dto.name && dto.name !== product.name) {
+    if (dto.name || dto.name !== product.name) {
       const duplicated = await this.productsRepository.findOne({
         where: { name: dto.name },
killedBy: ProductsService shouldNotCheckDuplicateWhenNameUnchanged
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/products/products.service.ts:80:9
   async update(id: string, dto: UpdateProductDto): Promise<ProductEntity> {
     const product = await this.getEntityById(id);
 
-    if (dto.name && dto.name !== product.name) {
+    if (false) {
       const duplicated = await this.productsRepository.findOne({
         where: { name: dto.name },
killedBy: ProductsService shouldThrowConflictWhenUpdateRenamesToExistingProductName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/products/products.service.ts:84:23
       const duplicated = await this.productsRepository.findOne({
         where: { name: dto.name },
       });
-      if (duplicated) {
-        throw new ConflictException('Ya existe un producto con ese nombre');
-      }
+      if (duplicated) {}
     }
 
killedBy: ProductsService shouldThrowConflictWhenUpdateRenamesToExistingProductName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:84:11
       const duplicated = await this.productsRepository.findOne({
         where: { name: dto.name },
       });
-      if (duplicated) {
+      if (false) {
         throw new ConflictException('Ya existe un producto con ese nombre');
       }
killedBy: ProductsService shouldThrowConflictWhenUpdateRenamesToExistingProductName
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/products/products.service.ts:89:41
       }
     }
 
-    if (dto.minimumStock !== undefined) {
-      product.minimumStock = dto.minimumStock.toFixed(2);
-    }
+    if (dto.minimumStock !== undefined) {}
 
     if (dto.name !== undefined) {
killedBy: ProductsService shouldUpdateOnlyProvidedFieldsAndPersist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4.00"
Received: "1.00"

[Killed] ConditionalExpression
src/products/products.service.ts:89:9
       }
     }
 
-    if (dto.minimumStock !== undefined) {
+    if (false) {
       product.minimumStock = dto.minimumStock.toFixed(2);
     }
killedBy: ProductsService shouldUpdateOnlyProvidedFieldsAndPersist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4.00"
Received: "1.00"

[Killed] ConditionalExpression
src/products/products.service.ts:93:9
       product.minimumStock = dto.minimumStock.toFixed(2);
     }
 
-    if (dto.name !== undefined) {
+    if (true) {
       product.name = dto.name;
     }
killedBy: ProductsService shouldUpdateOnlyMinimumStockWhenOtherFieldsOmitted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fijo"
Received: undefined

[Killed] EqualityOperator
src/products/products.service.ts:93:9
       product.minimumStock = dto.minimumStock.toFixed(2);
     }
 
-    if (dto.name !== undefined) {
+    if (dto.name === undefined) {
       product.name = dto.name;
     }
killedBy: ProductsService shouldUpdateOnlyProvidedFieldsAndPersist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nuevo nombre"
Received: "Viejo"

[Killed] ConditionalExpression
src/products/products.service.ts:96:9
     if (dto.name !== undefined) {
       product.name = dto.name;
     }
-    if (dto.description !== undefined) {
+    if (true) {
       product.description = dto.description;
     }
killedBy: ProductsService shouldUpdateOnlyMinimumStockWhenOtherFieldsOmitted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "d"
Received: undefined

[Killed] EqualityOperator
src/products/products.service.ts:96:9
     if (dto.name !== undefined) {
       product.name = dto.name;
     }
-    if (dto.description !== undefined) {
+    if (dto.description === undefined) {
       product.description = dto.description;
     }
killedBy: ProductsService shouldUpdateOnlyProvidedFieldsAndPersist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nueva desc"
Received: "d0"

[Killed] ConditionalExpression
src/products/products.service.ts:99:9
     if (dto.description !== undefined) {
       product.description = dto.description;
     }
-    if (dto.unitMeasure !== undefined) {
+    if (true) {
       product.unitMeasure = dto.unitMeasure;
     }
killedBy: ProductsService shouldUpdateOnlyMinimumStockWhenOtherFieldsOmitted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "litros"
Received: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:99:9
     if (dto.description !== undefined) {
       product.description = dto.description;
     }
-    if (dto.unitMeasure !== undefined) {
+    if (false) {
       product.unitMeasure = dto.unitMeasure;
     }
killedBy: ProductsService shouldUpdateOnlyProvidedFieldsAndPersist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kg"
Received: "unidades"

[Killed] BlockStatement
src/products/products.service.ts:106:56
     return this.productsRepository.save(product);
   }
 
-  async deactivate(id: string): Promise<ProductEntity> {
-    const product = await this.getEntityById(id);
-    product.status = ProductStatus.INACTIVE;
-    return this.productsRepository.save(product);
-  }
+  async deactivate(id: string): Promise<ProductEntity> {}
 }
 
killedBy: ProductsService shouldDeactivateProductWhenNoMovements
statusReason: TypeError: Cannot read properties of undefined (reading 'status')
